app/views/movies/edit.html.haml

SELECT "movies".* FROM "movies"
---
  = label :movie, :rating, 'Rating'
  = select :movie, :rating, Movie.all