app/views/movies/new.html.haml

  = label :movie, :rating, 'Rating'
  = select :movie, :rating, Movie.all
---
SELECT "movies".* FROM "movies"