app/controllers/movies_controller.rb

INSERT INTO "movies" ("description", "rating", "release_date", "title") VALUES (?, ?, ?, ?)  [["description", nil], ["rating", "#<Movie:0x00000004273c20>"], ["release_date", Fri, 23 Aug 2013 00:00:00 UTC +00:00], ["title", "Elysium"]]
---
  def create
    @movies = Movie.create!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
   id = params[:id] # retrieve movie ID from URL route
   @movie = Movie.find(id) # look up movie by unique ID